RT-Thread/rt-thread/bsp/stm32/libraries/STM32G4xx_HAL/STM32G4xx_HAL_Driver/Inc/stm32g4xx_hal_dma.h
/** @defgroup DMA_Exported_Constants DMA Exported Constants
  * @{
  */

/** @defgroup DMA_Error_Code DMA Error Code
  * @{
  */
#define HAL_DMA_ERROR_NONE             0x00000000U    /*!< No error                              */
#define HAL_DMA_ERROR_TE               0x00000001U    /*!< Transfer error                        */
#define HAL_DMA_ERROR_NO_XFER          0x00000004U    /*!< Abort requested with no Xfer ongoing  */
#define HAL_DMA_ERROR_TIMEOUT          0x00000020U    /*!< Timeout error                         */
#define HAL_DMA_ERROR_NOT_SUPPORTED    0x00000100U    /*!< Not supported mode                    */
#define HAL_DMA_ERROR_SYNC             0x00000200U    /*!< DMAMUX sync overrun  error              */
#define HAL_DMA_ERROR_REQGEN           0x00000400U    /*!< DMAMUX request generator overrun  error */
/**
  * @}
  */

/** @defgroup DMA_request DMA request
  * @{
  */
#define DMA_REQUEST_MEM2MEM            0U  /*!< memory to memory transfer   */

#define DMA_REQUEST_GENERATOR0         1U
#define DMA_REQUEST_GENERATOR1         2U
#define DMA_REQUEST_GENERATOR2         3U
#define DMA_REQUEST_GENERATOR3         4U

#define DMA_REQUEST_ADC1               5U

#define DMA_REQUEST_DAC1_CHANNEL1      6U
#define DMA_REQUEST_DAC1_CHANNEL2      7U

#define DMA_REQUEST_TIM6_UP            8U
#define DMA_REQUEST_TIM7_UP            9U

#define DMA_REQUEST_SPI1_RX           10U
#define DMA_REQUEST_SPI1_TX           11U
#define DMA_REQUEST_SPI2_RX           12U
#define DMA_REQUEST_SPI2_TX           13U
#define DMA_REQUEST_SPI3_RX           14U
#define DMA_REQUEST_SPI3_TX           15U

#define DMA_REQUEST_I2C1_RX           16U
#define DMA_REQUEST_I2C1_TX           17U
#define DMA_REQUEST_I2C2_RX           18U
#define DMA_REQUEST_I2C2_TX           19U
#define DMA_REQUEST_I2C3_RX           20U
#define DMA_REQUEST_I2C3_TX           21U
#if defined (I2C4)
#define DMA_REQUEST_I2C4_RX           22U
#define DMA_REQUEST_I2C4_TX           23U
#endif /* I2C4 */

#define DMA_REQUEST_USART1_RX         24U
#define DMA_REQUEST_USART1_TX         25U
#define DMA_REQUEST_USART2_RX         26U
#define DMA_REQUEST_USART2_TX         27U
#define DMA_REQUEST_USART3_RX         28U
#define DMA_REQUEST_USART3_TX         29U

#define DMA_REQUEST_UART4_RX          30U
#define DMA_REQUEST_UART4_TX          31U
#if defined (UART5)
#define DMA_REQUEST_UART5_RX          32U
#define DMA_REQUEST_UART5_TX          33U
#endif /* UART5 */

#define DMA_REQUEST_LPUART1_RX        34U
#define DMA_REQUEST_LPUART1_TX        35U

#define DMA_REQUEST_ADC2              36U
#if defined (ADC3)
#define DMA_REQUEST_ADC3              37U
#endif /* ADC3 */
#if defined (ADC4)
#define DMA_REQUEST_ADC4              38U
#endif /* ADC4 */
#if defined (ADC5)
#define DMA_REQUEST_ADC5              39U
#endif /* ADC5 */

#if defined (QUADSPI)
#define DMA_REQUEST_QUADSPI           40U
#endif /* QUADSPI */

#if defined (DAC2)
#define DMA_REQUEST_DAC2_CHANNEL1     41U
#endif /* DAC2 */

#define DMA_REQUEST_TIM1_CH1          42U
#define DMA_REQUEST_TIM1_CH2          43U
#define DMA_REQUEST_TIM1_CH3          44U
#define DMA_REQUEST_TIM1_CH4          45U
#define DMA_REQUEST_TIM1_UP           46U
#define DMA_REQUEST_TIM1_TRIG         47U
#define DMA_REQUEST_TIM1_COM          48U

#define DMA_REQUEST_TIM8_CH1          49U
#define DMA_REQUEST_TIM8_CH2          50U
#define DMA_REQUEST_TIM8_CH3          51U
#define DMA_REQUEST_TIM8_CH4          52U
#define DMA_REQUEST_TIM8_UP           53U
#define DMA_REQUEST_TIM8_TRIG         54U
#define DMA_REQUEST_TIM8_COM          55U

#define DMA_REQUEST_TIM2_CH1          56U
#define DMA_REQUEST_TIM2_CH2          57U
#define DMA_REQUEST_TIM2_CH3          58U
#define DMA_REQUEST_TIM2_CH4          59U
#define DMA_REQUEST_TIM2_UP           60U

#define DMA_REQUEST_TIM3_CH1          61U
#define DMA_REQUEST_TIM3_CH2          62U
#define DMA_REQUEST_TIM3_CH3          63U
#define DMA_REQUEST_TIM3_CH4          64U
#define DMA_REQUEST_TIM3_UP           65U
#define DMA_REQUEST_TIM3_TRIG         66U

#define DMA_REQUEST_TIM4_CH1          67U
#define DMA_REQUEST_TIM4_CH2          68U
#define DMA_REQUEST_TIM4_CH3          69U
#define DMA_REQUEST_TIM4_CH4          70U
#define DMA_REQUEST_TIM4_UP           71U

#if defined (TIM5)
#define DMA_REQUEST_TIM5_CH1          72U
#define DMA_REQUEST_TIM5_CH2          73U
#define DMA_REQUEST_TIM5_CH3          74U
#define DMA_REQUEST_TIM5_CH4          75U
#define DMA_REQUEST_TIM5_UP           76U
#define DMA_REQUEST_TIM5_TRIG         77U
#endif /* TIM5 */

#define DMA_REQUEST_TIM15_CH1         78U
#define DMA_REQUEST_TIM15_UP          79U
#define DMA_REQUEST_TIM15_TRIG        80U
#define DMA_REQUEST_TIM15_COM         81U

#define DMA_REQUEST_TIM16_CH1         82U
#define DMA_REQUEST_TIM16_UP          83U
#define DMA_REQUEST_TIM17_CH1         84U
#define DMA_REQUEST_TIM17_UP          85U

#if defined (TIM20)
#define DMA_REQUEST_TIM20_CH1         86U
#define DMA_REQUEST_TIM20_CH2         87U
#define DMA_REQUEST_TIM20_CH3         88U
#define DMA_REQUEST_TIM20_CH4         89U
#define DMA_REQUEST_TIM20_UP          90U
#endif /* TIM20 */

#define DMA_REQUEST_AES_IN            91U
#define DMA_REQUEST_AES_OUT           92U

#if defined (TIM20)
#define DMA_REQUEST_TIM20_TRIG        93U
#define DMA_REQUEST_TIM20_COM         94U
#endif /* TIM20 */

#if defined (HRTIM1)
#define DMA_REQUEST_HRTIM1_M          95U
#define DMA_REQUEST_HRTIM1_A          96U
#define DMA_REQUEST_HRTIM1_B          97U
#define DMA_REQUEST_HRTIM1_C          98U
#define DMA_REQUEST_HRTIM1_D          99U
#define DMA_REQUEST_HRTIM1_E          100U
#define DMA_REQUEST_HRTIM1_F          101U
#endif /* HRTIM1 */

#define DMA_REQUEST_DAC3_CHANNEL1     102U
#define DMA_REQUEST_DAC3_CHANNEL2     103U
#if defined (DAC4)
#define DMA_REQUEST_DAC4_CHANNEL1     104U
#define DMA_REQUEST_DAC4_CHANNEL2     105U
#endif /* DAC4 */

#if defined (SPI4)
#define DMA_REQUEST_SPI4_RX           106U
#define DMA_REQUEST_SPI4_TX           107U
#endif /* SPI4 */

#define DMA_REQUEST_SAI1_A            108U
#define DMA_REQUEST_SAI1_B            109U

